Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P26.tmx
Source language: en_us
Languages: zh_cn

source: Mastiff
zh_cn: 獒

source: Earlier, on the trail, they'd seen it.
zh_cn: 起初，在山路上，他们已见过了它。

source: The massive dog.
zh_cn: 那只獒。

source: Tugging at its master's leash, so that the young man's calves bulged with muscle as he fought to hold the dog back.
zh_cn: 在狗主人皮带的拴系下，它还一个劲往前冲，因为要拼命拽住它，那个年轻人腿肚子的肌肉都鼓凸出来了。

source: Grunting what sounded like "Damn, Rob-roy! Damn dog!" in a tone of exasperated affection.
zh_cn: 他口里咕噜的像是“该死的，罗伯-罗伊！该死的狗！”，语气里透出恼怒的爱意。

source: Signs along the trail forbade dogs without leashes.
zh_cn: 山路边的标牌上写着禁止没有拴系的狗。

source: At least this dog was on a leash.
zh_cn: 至少这条狗是用皮带拴着的。

source: The woman stared at the animal, not twelve feet away, wheezing and panting.
zh_cn: 女人盯着这只畜牲，它与她相隔不到十二英尺，呼哧着，喘息着。

source: Its head was larger than hers, with a pronounced black muzzle, bulging glassy eyes.
zh_cn: 它的头比她的还大，鼻口赫然，眼球暴突，眼神呆滞。

source: Its jaws were powerful and slack; its large, long tongue, as rosy-pink as a sexual organ, dripped slobber.
zh_cn: 它的爪子强劲而松弛；它的舌头又大又长，粉红犹如性器，口水直淌。

source: The dog was pale-brindle-furred, with a deep chest, strong shoulders and legs, a taut tail.
zh_cn: 这条狗的毛皮带着浅色斑纹，胸脯发达，肩背壮实，四肢有力，尾巴紧绷。

source: It must have weighed at least two hundred pounds.
zh_cn: 它少说有两百磅重。

source: Its breathing was damply audible, unsettling.
zh_cn: 它的呼吸潮湿可闻，令人不安。

source: The dog's straggly-bearded young master, in beige hoodie, khaki cargo shorts, and hiking boots, gripped the leather leash with both hands, squinting at the woman, and at the man behind her, with an expression that seemed apologetic or defensive; or maybe, the woman thought, the young man was laughing at them, ordinary hikers without a monster-dog to pull and strain at their arms.
zh_cn: 年轻的狗主人胡须凌乱，穿着米黄色的连帽衫、卡其布工装短裤和登山靴，他双手紧抓着皮带，乜斜眼睛看着女人，以及她身后的男人，表情像是带着歉意，又像是藏着戒备，或者，在女人看来，也许那个年轻人在嘲笑他们——手上竟然没有拽着一条怪兽狗的普通登山者。

source: The woman thought, That isn't a dog.
zh_cn: 女人想，那不是一只狗。

source: It's a human being on its hands and knees!
zh_cn: 瞧它的前腿和膝盖，分明是一个人嘛！

source: Such surreal thoughts bombarded the woman's brain, waking and sleeping.
zh_cn: 这样稀奇古怪的念头连珠炮般轰击着女人半睡半醒的大脑。

source: As long as no one else knew about them, she paid them little heed.
zh_cn: 只要没有其他人知道这些念头，她对它们并不留意。

source: Fortunately, the dog and its owner were taking another trail into Wildcat Canyon.
zh_cn: 幸运的是，那只狗和它的主人走了另一条去野猫峡谷的山路。

source: The dog lunged forward eagerly, sniffing at the ground, the young man following with muttered curses.
zh_cn: 狗急切地向前猛冲，一边在地上嗅着，年轻人的轻声咒骂踵随其后。

source: The woman and her male companion continued on the main trail, which was three miles uphill, into the sun, to Wildcat Peak.
zh_cn: 女人与她的男性同伴继续在主路上行走，这条山路通往野猫峰，三英里长的向阳的上坡路。

source: The man, sensing the woman's unease at the sight of the dog, made some joke, which the woman couldn't quite hear and did not acknowledge.
zh_cn: 男人觉察出了女人见到那只狗而产生的不安，于是开起了玩笑，而这些女人几乎没听进去，也体会不了。

source: They were walking single file, the woman in the lead.
zh_cn: 他们单列而行，女人走在前面。

source: She waited for the man to touch her shoulder, as another man might have done, to reassure her, but she knew that he would not, and he did not.
zh_cn: 她等着男人来触碰她的肩膀，像其他男人也许会做的那样，让她安心，但她知道他不会的，他没这么做。

source: Instead, the man said, in a tone of slight reproof, that the dog was an English mastiff- "Beautiful dog."
zh_cn: 反而，男人带着轻微责备的口吻说，那狗是只英国獒——“漂亮的狗”。

source: Much of what the man said to the woman, she understood, was in rebuke of her narrow judgment, her timorous ways.
zh_cn: 男人对女人说这番话的主要意思，照她理解，是责备她的偏见，她的怯懦表现。

source: Sometimes the man was amused by these qualities.
zh_cn: 有时男人会被她的这些特质所取悦。

source: At other times, she saw in his face an expression of startled disapproval, veiled contempt.
zh_cn: 而在其他时候，她在他脸上看到的是愕然反对的表情，藏掖着轻蔑。

source: The woman said, over her shoulder, with a wild little laugh, "Yes! Beautiful."
zh_cn: 女人回过头，带着一丝怒意的轻笑，说道：“是的，好漂亮！”

source: The hike had been the man's suggestion.
zh_cn: 登山是男人的提议。

source: Or, rather, in his oblique way, which was perhaps a strategy of shyness, he'd simply told her that he was going hiking this weekend, and asked if she wanted to join him.
zh_cn: 或者，毋宁说，是以他那拐弯抹角的方式，这也许是种腼腆的做法，他只是告诉他，这个周末要去登山，并问她是否愿意一起来。

source: He had not risked being rejected; he'd made it clear that he would be going, regardless.
zh_cn: 他不用冒被拒绝的风险；他已经清楚地表示，无论如何他都会去。

source: The woman had been introduced to the man seven weeks earlier, at a dinner party at a mutual friend's home in the Berkeley Hills.
zh_cn: 七周前，在伯克利山，一位共同朋友的家庭宴会中，女人被介绍与男人相识。

source: The friend, closer to the man than to the woman, had said to the man, "You'll like Mariella. You'll like her face," and to the woman, "Simon's an extraordinary person, but it may not be evident immediately.
zh_cn: 那位朋友与男人的关系更好，他对男人说，“你会喜欢玛瑞拉的。你会喜欢她的脸，”又对女人说，“西蒙是个超棒的人，不过也许乍看去不是那么回事。

source: Give him time."
zh_cn: 给他些时间。”

source: The woman and the man had gone on several walks together already.
zh_cn: 女人和男人已经共同出行过几次。

source: But a hike of such ambition seemed, to the woman, something quite different.
zh_cn: 但这样一次富于企图的登山，在女人看来，是有些大大的不同了。

source: She'd said, "Yes! I'd love that."
zh_cn: 她说，“是的！我喜欢这个。”

source: It was late afternoon.
zh_cn: 傍晚时分。

source: They had been hiking for several hours, and were now making their way single file down the mountain.
zh_cn: 他们已经爬了几个小时的山，现在排成单列下山了。

source: The woman was descending first, then the man.
zh_cn: 女人走在前头，男人跟随其后。

source: The man, the more experienced hiker, wanted to watch over the woman, whom he didn't trust not to hurt herself.
zh_cn: 男人的登山经验更加丰富，想要看护着女人，他都不信她不会伤害到她自己。

source: She'd surprised him by wearing lightweight running shoes on the trail and not, as he was wearing, hiking boots.
zh_cn: 令他吃惊的是，她竟然穿着轻便的跑鞋走山路，而不是像他一样穿着登山靴。

source: She hadn't thought to bring water, either.
zh_cn: 她也没想过要带水。

source: He carried a twenty-ounce plastic bottle of water for them both.
zh_cn: 他带了供两人喝的二十盎司容量塑料瓶的水。

source: The man was a little annoyed by the woman. Yet he was drawn to her.
zh_cn: 男人有点被女人惹恼了，虽然他被她所吸引。

source: He hoped to like her more than he did- he hoped to adore her.
zh_cn: 他希望喜欢她更多些——他希望爱上她。

source: He had been very lonely for too long and had come to bitterly resent the solitude of his life.
zh_cn: 他已经非常孤独了太久，逐渐痛恨起这孑然一身的生活。

source: It had been an unnaturally balmy day for late March.
zh_cn: 在三月末，这是一个不同寻常温和的日子。

source: At midday, the temperature was perhaps sixty-eight degrees.
zh_cn: 正午时候，气温也许有68华氏度。

source: But now, as the sun sank like a broken bloody egg, darkness and cold began to rise from the earth.
zh_cn: 但现在呢，随着太阳西沉如一个破裂的血红的蛋，黑暗和寒冷开始自地表升起。

source: The day before, the man had suggested to the woman that she bring a light canvas jacket in her backpack; he knew how quickly the mountain trail could turn cold in the late afternoon, but she had worn just a sweater, jeans, and a sun visor. (The woman's eyes were sensitive to sunlight, even with sunglasses.
zh_cn: 前一天，男人曾建议女人在她的背包里带上一件轻便的帆布夹克；他知道山路在傍晚会迅速变冷，但她却只穿了毛衣和牛仔裤，戴了遮阳帽舌。（即便是戴着太阳镜，女人的眼睛还是对阳光敏感。

source: She hated how easily they watered, tears running down her cheeks like an admission of weakness.) And she'd confounded the man by not bringing a backpack at all, with the excuse that she hated feeling "burdened."
zh_cn: 她讨厌眼睛那么容易出水，泪水会从她的面颊淌落，像是承认自己软弱一样。）令男人感到困惑的是，她根本就不带背包，找的借口是她讨厌“被负累”的感觉。

source: In the gathering chill, the woman was shivering.
zh_cn: 寒气凝聚之下，女人开始瑟瑟发抖。

source: The trail had looped upward through pine woods to a spectacular view at the peak, where the man had given the woman some water to drink.
zh_cn: 山路在松林间盘旋而上，沿路他们到达了顶峰，此处是一派壮丽景色，男人在这里给了女人一些水喝。

source: Though she said she wasn't thirsty, he insisted.
zh_cn: 尽管她说自己不渴，但他还是坚持要她喝下。

source: There's a danger of dehydration when you've been exerting yourself, he said.
zh_cn: 他说，等你精疲力竭时，就会有脱水的危险。

source: He spoke sternly, as if he were a parent she could not reasonably oppose.
zh_cn: 他言辞严厉，仿佛他是家长，她没理由唱反调。

source: He spoke with the confidence of one who is rarely challenged.
zh_cn: 他的话语充满自信，不容他人质疑。

source: At times, the woman quite liked his air of authority; other times, she resented it.
zh_cn: 有时，女人十分喜欢他这种权威态度；有时，她又痛恨这种态度。

source: The man seemed always to be regarding her with a bemused look, like a scientist confronted with a curious specimen.
zh_cn: 男人似乎总以一种若有所思的眼光注视着她，就像科学家遇到了奇怪的标本。

source: She didn't want to think- yet she thought, compulsively- that he was comparing her with other women he'd known, and finding her lacking.
zh_cn: 她不愿去想——然而她还是不由自主地会想——他是在把她和他已知的其他女人相比较，以便寻出她的不足。

source: Then the man took photographs with his new camera, while the woman gazed out at the view.
zh_cn: 而后，男人用他的新相机拍照，女人向外俯瞰风景。

source: Along the horizon was a rim of luminous blue- the Pacific Ocean, miles away.
zh_cn: 地平线上，有一抹明亮的蓝——那是数英里之外的太平洋。

source: In the near distance were small lakes, streams.
zh_cn: 近处点缀着小湖和小溪。

source: The hills were strangely sculpted, like those bald slopes in the paintings of Thomas Hart Benton.
zh_cn: 山丘造型奇特，就像托马斯·哈特·本顿画作中那些光秃秃的斜坡。

source: Absorbed in his photography, the man seemed to forget about the woman.
zh_cn: 男人全神贯注地拍照，似乎忘了女人的存在。

source: How self-contained he could be, how maddening!
zh_cn: 他是多么沉默寡言，多么令人气恼啊！

source: The woman had never been so at repose in her self.
zh_cn: 女人还从来没有这样独守平静过。

source: For nearly an hour, he lingered, taking photographs.
zh_cn: 几乎有一个小时，他逗留徘徊着，拍摄照片。

source: During this time, other hikers came and went.
zh_cn: 在这段时间里，其他登山者来了又去。

source: The woman spoke briefly with these hikers, while the man appeared oblivious of them.
zh_cn: 女人与这些登山者简单地聊了聊，而男人似乎对他们浑然不觉。

source: It wasn't his habit, he'd told her, to strike up conversations with "random" people.
zh_cn: 他告诉过她，与“随便什么”人攀谈，那不是他的习惯。

source: "Why not?" she'd asked.
zh_cn: “为什么不呢？”她问道。

source: And he'd said, with a look that suggested that her question was virtually incomprehensible, "Why not? Because I'll never see them again."
zh_cn: 他以一种暗示她的问题简直不可理解的表情说道，“为什么不？因为我再也不会见到他们了。”

source: With her provocative little laugh, the woman had said, "But that's the best reason for talking to strangers- you'll never see them again."
zh_cn: 带着挑衅的微笑，女人说，“但这正是与陌生人交谈的最佳理由——你永远都不会再见到他们。”

source: At least the bearded young man with the English mastiff hadn't climbed to the top of Wildcat Peak, though other hikers with dogs had made their way there.
zh_cn: 至少那个带着英国獒的年轻胡须男还没有登上野猫峰山顶，尽管其他带狗的登山者都已经抵达此地。

source: A succession of dogs, in fact, of all sizes and breeds, fortunately most of them well behaved and disinclined to bark, several of them trailing their masters, older dogs, looking chastised, winded.
zh_cn: 实际上，大小不一、品种各异的狗陆续而来，幸运的是，它们中的大多数都举止规矩，无意吠叫，其中有些尾随着它们的主人，老狗们看去像受罚了一般，喘不过气来。

source: "Nice dog!
zh_cn: “狗不错哇！

source: What's his name?" the woman would ask.
zh_cn: 它叫什么名字？”女人问道。

source: Or, "What breed is he?"
zh_cn: 或者，“它什么品种啊？”

source: She understood that the man had taken note of her fear of the mastiff at the start of the hike.
zh_cn: 她知道男人在这次登山开始时就已经注意到她害怕獒。

source: How she'd tensed at the sight of the ugly wheezing beast.
zh_cn: 看到那只丑陋的呼哧的野兽，她的神经绷得多紧啊。

source: It had to be the largest dog she'd ever seen, as big as a St. Bernard but totally lacking that dog's benign shaggy aura.
zh_cn: 它一定是她见过的最大的狗，跟圣伯纳犬一般大，但全然没有那种狗的温顺的毛蓬蓬的气息。

source: And so at the peak the woman made a point of engaging dog owners in conversations, in a bright, airy, friendly way.
zh_cn: 所以，在顶峰上，女人特别注意找狗的主人交谈，以一种愉快而轻松友好的方式。

source: She even petted the gentler dogs.
zh_cn: 她甚至还抚摸了那些特别温顺的狗。

source: As a child of nine or ten, she'd been attacked by a German shepherd.
zh_cn: 童年九、十岁的时候，她曾遭遇一只德国牧羊犬的攻击。

source: She'd done nothing to provoke the attack and could only remember screaming and trying to run as the dog barked furiously at her and snapped at her bare legs.
zh_cn: 她什么也没做就引发了那次攻击，只记得尖声大叫，拼命狂奔，狗朝她狂吠不已，猛咬她裸露的腿。

source: Only the intervention of adults had saved her.
zh_cn: 只到成人介入，她才得救。

source: The woman hadn't told the man much about her past.
zh_cn: 女人未曾跟男人过多谈及她的过去。

source: Not yet.
zh_cn: 现在还不是时候。

source: And possibly wouldn't.
zh_cn: 也许就不会说。

source: Her principle was Never reveal your weakness.
zh_cn: 她的原则是“永远不要暴露你的弱点”。

source: Especially to strangers: this was essential.
zh_cn: 尤其是对陌生人：这是必不可少的。

source: Technically, the woman and the man were "lovers," but they were not yet intimate.
zh_cn: 名义上说，女人和男人是“情人”，但他们尚不够亲密。

source: You might say- the woman might have said- that they were still, fundamentally, strangers to each other.
zh_cn: 你也许会说——女人也许会说——他们其实仍旧相互陌生。

source: They'd been together in the woman's house, upstairs in her bed, but they hadn't yet spent an entire night together.
zh_cn: 他们曾在女人的房子里共度，在楼上她的床上，但他们还未在一起呆过整整一晚。

source: The man felt self-conscious in the woman's house, and the woman hadn't been able to fall asleep beside him; the physical fact of him was so distracting.
zh_cn: 男人在女人的房子里感觉不自在，而女人也无法在他身旁入睡；他的身体存在令她很是分心。

source: Naked and horizontal, the man seemed much larger than he did clothed and vertical.
zh_cn: 平躺着裸露的男人身体，似乎比他穿着衣服站立时要大出许多。

source: He breathed loudly, wetly, through his open mouth, and though he woke affably when she nudged him, the woman hadn't wanted to keep waking him.
zh_cn: 透过敞开的嘴，他的呼吸响亮而湿润，尽管当她轻推他时，他会和气地醒来，女人还是不愿老是叫醒他。

source: In truth, the woman had never been very comfortable with a man at close quarters, unless she'd been drinking.
zh_cn: 事实上，女人还从来没有在密闭的房间里与男人呆一起感觉非常舒服过，除非是她喝醉了。

source: But this man scarcely drank.
zh_cn: 但这个男人很少饮酒。

source: And the woman no longer lost herself in drink; that life was behind her.
zh_cn: 女人再也不愿沉迷于酒精；那种生活已离她远去了。

source: The woman liked to tell her friends that she wanted not to get married but to be married.
zh_cn: 女人喜欢跟自己的朋友说，她不想要结婚的过程，她要的是婚姻这种状态。

source: She wanted a relationship that seemed mature, if not old and settled, from the start.
zh_cn: 即便交往不会持久不够稳定，她还是要一段从一开始就看起来成熟的关系。

source: Newness and rawness did not appeal to her.
zh_cn: 新鲜和生疏吸引不了她。

source: "Excuse me? When do you think we might head back?" She spoke to the man hesitantly, not wanting to break his concentration.
zh_cn: “对不起，什么时候你认为我们可以往回走？”她犹豫地对男人说，并不愿打断他的聚精会神。

source: In their relationship, she had not yet displayed any impatience; she had not yet raised her voice.
zh_cn: 在他们的交往中，她还没有表露过任何的不耐烦；她还未提高过嗓门。

source: At last, the man put his camera, a heavy, complicated instrument, into his backpack, along with the water bottle, which contained just two or three inches of water now- "We might need this later."
zh_cn: 终于，男人将他的相机，那台沉重而复杂的设备放入了背包，一同放入的还有水瓶，这里面现在仅有两三英寸深的水了——“我们或许后面还需要这些水。”

source: His movements were measured and deliberate, as if he were alone, and the woman felt a sudden stab of dislike for him, anger that he could take such care with trivial matters and yet did not seem to love her.
zh_cn: 他的举动从容不迫、不慌不忙，仿佛他是独自一人，对他的反感突然刺中了女人，她愤怒于他会如此在意那些细枝末节，似乎他并不爱她。

source: There were no rest rooms on the damn trail, of course.
zh_cn: 当然，这条该死的山路上没有休息室。

source: These were serious hiking trails, for serious hikers.
zh_cn: 这都是些专业登山者使用的标准登山道。

source: Longingly, the woman recalled the facilities at the trailhead.
zh_cn: 女人无比渴望地回想起山路起点处的设施。

source: How long would it take to hike back down?
zh_cn: 往回走还有多远啊？

source: An hour?
zh_cn: 一小时？

source: Two?
zh_cn: 两小时？

source: For male hikers, stopping to urinate in the woods was no great matter; for female hikers, an effort and an embarrassment.
zh_cn: 对于男性登山者而言，停下来在林子里撒尿不是什么大问题，而对女性登山者而言，这不啻是一种麻烦和难堪。

source: Not since she was a young girl, trapped on an endless, hateful hike in summer camp in the Adirondacks, had she been forced to relieve herself in the woods.
zh_cn: 她还是个年轻女孩的时候，曾在阿迪朗达克山的夏令营里陷入一场没完没了的令人厌恶的登山，她不得不在树林里方便。

source: The memory was hazy and blurred with shame, and humiliation at the very pettiness of her discomfort.
zh_cn: 记忆模糊不清，与耻辱杂糅在一起，她为自己斤斤计较于不适而感到不好意思。

source: If she'd told this story to the man, he would probably have laughed at her.
zh_cn: 倘若她把这个故事说给男人听，他可能会笑话她吧。

source: Driving to the park that day, the man and the woman had felt very happy together.
zh_cn: 开车去公园的那一天，男人和女人在一起感觉很开心。

source: It sometimes happened to them, unpredictably- a sudden flaring up of happiness, even joy, in each other's company.
zh_cn: 这有时会发生在他们身上，不可预期地——突如其来的欢乐，甚至喜悦，在彼此的相伴中。

source: The man was unusually talkative.
zh_cn: 男人异乎寻常地健谈。

source: The woman laughed at his remarks, surprised that he could be so witty.
zh_cn: 女人笑对他的高谈阔论，惊奇于他竟然如此能说会道。

source: She was touched that, a few days before, he'd visited the art gallery she ran, and purchased a small soapstone sculpture.
zh_cn: 几天之前，他去参观她开的画廊时，买了一座小小的皂石雕像，她被打动了。

source: The woman slid over in the passenger's seat, to sit closer to the man, as a young girl might do, impulsively.
zh_cn: 女人从副驾驶座位滑过来，挨得离男人更近些，就像年轻女孩可能做的那样，兴冲冲地。

source: How natural this felt- a rehearsal of intimacy!
zh_cn: 这感觉多么自然——亲昵的预演！

source: The car radio was playing a piano piece by the Czech composer Jana?ek, "In the Mists."
zh_cn: 汽车收音机里正播放着捷克作曲家雅纳切克的钢琴曲《迷雾之中》。

source: The woman recognized it after a few notes.
zh_cn: 女人在几个音符之后便听出了它。

source: She'd played the piano cycle as a girl.
zh_cn: 她还是个女孩时，曾经演奏过这支钢琴组曲。

source: Her eyes filled with tears as she remembered.
zh_cn: 她记得，她泪水盈眶了。
